In [1]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('../data/01. CCTV_in_Seoul.csv', encoding='utf-8') # .. 은 한 단계 상위폴더로 이동
CCTV_Seoul

     기관명    소계  2013년도 이전  2014년  2015년  2016년
0    강남구  2780       1292    430    584    932
1    강동구   773        379     99    155    377
2    강북구   748        369    120    138    204
3    강서구   884        388    258    184     81
4    관악구  1496        846    260    390    613
5    광진구   707        573     78     53    174
6    구로구  1561       1142    173    246    323
7    금천구  1015        674     51    269    354
8    노원구  1265        542     57    451    516
9    도봉구   485        238    159     42    386
10  동대문구  1294       1070     23    198    579
11   동작구  1091        544    341    103    314
12   마포구   574        314    118    169    379
13  서대문구   962        844     50     68    292
14   서초구  1930       1406    157    336    398
15   성동구  1062        730     91    241    265
16   성북구  1464       1009     78    360    204
17   송파구   618        529     21     68    463
18   양천구  2034       1843    142     30    467
19  영등포구   904        495    214    195    373
20   용산구  1624       1368    218    112    398
21   은평구  1873       1138    224    278    468
22   종로구  1002        464    314    211    630
23    중구   671        413    190     72    348
24   중랑구   660        509    121    177    109

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace=True)

In [7]:
CCTV_Seoul

      구별    소계  2013년도 이전  2014년  2015년  2016년
0    강남구  2780       1292    430    584    932
1    강동구   773        379     99    155    377
2    강북구   748        369    120    138    204
3    강서구   884        388    258    184     81
4    관악구  1496        846    260    390    613
5    광진구   707        573     78     53    174
6    구로구  1561       1142    173    246    323
7    금천구  1015        674     51    269    354
8    노원구  1265        542     57    451    516
9    도봉구   485        238    159     42    386
10  동대문구  1294       1070     23    198    579
11   동작구  1091        544    341    103    314
12   마포구   574        314    118    169    379
13  서대문구   962        844     50     68    292
14   서초구  1930       1406    157    336    398
15   성동구  1062        730     91    241    265
16   성북구  1464       1009     78    360    204
17   송파구   618        529     21     68    463
18   양천구  2034       1843    142     30    467
19  영등포구   904        495    214    195    373
20   용산구  1624       1368    218    112    398
21   은평구  1873       1138    224    278    468
22   종로구  1002        464    314    211    630
23    중구   671        413    190     72    348
24   중랑구   660        509    121    177    109

In [8]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [9]:
pop_Seoul = pd.read_excel("../data/01. population_in_Seoul.xls", encoding = "utf-8")
pop_Seoul

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [10]:
pop_Seoul = pd.read_excel("../data/01. population_in_Seoul.xls", 
                          header = 2,
                          usecols = 'B, D, G, J, N',
                          encoding = "utf-8")
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [38]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

import numpy as np

In [41]:
CCTV_Seoul.head()

CCTV_Seoul.sort_values(by='소계', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [44]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + 
                        CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전']  * 100

CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [ ]:
import numpy as np

In [14]:
dates = pd.date_range('2013-01-03', periods=6)
dates

DatetimeIndex(['2013-01-03', '2013-01-04', '2013-01-05', '2013-01-06',
               '2013-01-07', '2013-01-08'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-03  0.865430 -1.726651  0.000154  2.366610
2013-01-04  1.395372 -1.059809 -1.349884  0.089143
2013-01-05  0.760008 -0.619814  2.040612  1.598744
2013-01-06 -1.381124 -0.442042 -0.854514 -1.814239
2013-01-07 -0.775955 -0.618499 -0.722042 -0.728777
2013-01-08  1.045723  1.711384  0.448816 -0.405177

In [16]:
df.index

DatetimeIndex(['2013-01-03', '2013-01-04', '2013-01-05', '2013-01-06',
               '2013-01-07', '2013-01-08'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.318243 -0.459238 -0.072809  0.184384
std    1.119743  1.160178  1.217165  1.545803
min   -1.381124 -1.726651 -1.349884 -1.814239
25%   -0.391964 -0.949810 -0.821396 -0.647877
50%    0.812719 -0.619156 -0.360944 -0.158017
75%    1.000650 -0.486156  0.336651  1.221344
max    1.395372  1.711384  2.040612  2.366610

In [18]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-08  1.045723  1.711384  0.448816 -0.405177
2013-01-06 -1.381124 -0.442042 -0.854514 -1.814239
2013-01-07 -0.775955 -0.618499 -0.722042 -0.728777
2013-01-05  0.760008 -0.619814  2.040612  1.598744
2013-01-04  1.395372 -1.059809 -1.349884  0.089143
2013-01-03  0.865430 -1.726651  0.000154  2.366610

In [19]:
df.loc[:,['A', 'B']] # : 는 전체라는 의미

                   A         B
2013-01-03  0.865430 -1.726651
2013-01-04  1.395372 -1.059809
2013-01-05  0.760008 -0.619814
2013-01-06 -1.381124 -0.442042
2013-01-07 -0.775955 -0.618499
2013-01-08  1.045723  1.711384

In [21]:
df.loc['20130103', ['A', 'B']]

A    0.865430
B   -1.726651
Name: 2013-01-03 00:00:00, dtype: float64

In [22]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-06 -1.381124 -0.442042
2013-01-07 -0.775955 -0.618499

In [24]:
df.iloc[[1,2,4],[0,2]] # 뛰엄뛰엄 가지고 오고 싶을때 사용

                   A         C
2013-01-04  1.395372 -1.349884
2013-01-05  0.760008  2.040612
2013-01-07 -0.775955 -0.722042

In [25]:
df.iloc[[1,2],:] # 1행부터 2행까지, 모든 열

                   A         B         C         D
2013-01-04  1.395372 -1.059809 -1.349884  0.089143
2013-01-05  0.760008 -0.619814  2.040612  1.598744

In [26]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.865430 -1.726651  0.000154  2.366610
2013-01-04  1.395372 -1.059809 -1.349884  0.089143
2013-01-05  0.760008 -0.619814  2.040612  1.598744
2013-01-08  1.045723  1.711384  0.448816 -0.405177

In [27]:
df2 = df.copy()

In [28]:
df2

                   A         B         C         D
2013-01-03  0.865430 -1.726651  0.000154  2.366610
2013-01-04  1.395372 -1.059809 -1.349884  0.089143
2013-01-05  0.760008 -0.619814  2.040612  1.598744
2013-01-06 -1.381124 -0.442042 -0.854514 -1.814239
2013-01-07 -0.775955 -0.618499 -0.722042 -0.728777
2013-01-08  1.045723  1.711384  0.448816 -0.405177

In [29]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [30]:
df2

                   A         B         C         D      E
2013-01-03  0.865430 -1.726651  0.000154  2.366610    one
2013-01-04  1.395372 -1.059809 -1.349884  0.089143    one
2013-01-05  0.760008 -0.619814  2.040612  1.598744    two
2013-01-06 -1.381124 -0.442042 -0.854514 -1.814239  three
2013-01-07 -0.775955 -0.618499 -0.722042 -0.728777   four
2013-01-08  1.045723  1.711384  0.448816 -0.405177  three

In [31]:
df2['E'].isin(['two', 'four'])

2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
2013-01-07     True
2013-01-08    False
Freq: D, Name: E, dtype: bool

In [32]:
df2[df2['E'].isin(['two','four'])]  # two와 four 가 E 열에 있는 것만 찾아서 뿌려줌

                   A         B         C         D     E
2013-01-05  0.760008 -0.619814  2.040612  1.598744   two
2013-01-07 -0.775955 -0.618499 -0.722042 -0.728777  four

In [34]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-03  0.865430 -1.726651  0.000154  2.366610
2013-01-04  2.260802 -2.786460 -1.349730  2.455753
2013-01-05  3.020811 -3.406275  0.690883  4.054496
2013-01-06  1.639687 -3.848316 -0.163631  2.240258
2013-01-07  0.863732 -4.466815 -0.885673  1.511481
2013-01-08  1.909455 -2.755430 -0.436857  1.106304

In [35]:
df.apply(lambda x: x.max() - x.min())

A    2.776496
B    3.438035
C    3.390496
D    4.180848
dtype: float64